Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicTagAttributes.Offset Property
 The offset of the mark tag.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Offset { get; set; }
Public Property Offset As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
ViewMarkBasicTagAttributes Class
Tekla.Structures.Drawing Namespace